Documents/ПриходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>ПриходнаяНакладная</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоставкаМатериалов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеТовара</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПриходнаяНакладная/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПоставкаМатериаловКоличествоПриИзменении(Элемент)
	Элементы.ПоставкаМатериалов.ТекущиеДанные.Сумма=
	Элементы.ПоставкаМатериалов.ТекущиеДанные.Цена*
	Элементы.ПоставкаМатериалов.ТекущиеДанные.Количество;
КонецПроцедуры

&НаКлиенте
Процедура ПоставкаМатериаловЦенаПриИзменении(Элемент)
	Элементы.ПоставкаМатериалов.ТекущиеДанные.Сумма=
	Элементы.ПоставкаМатериалов.ТекущиеДанные.Цена*
	Элементы.ПоставкаМатериалов.ТекущиеДанные.Количество;
КонецПроцедуры
